Revit 2027 API
RebarConstraint.GetTargetHostFaceReference Method
Overload List
Name | Description
GetTargetHostFaceReference() |  Returns a reference to the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. Will throw exception if it's a multi target constraint.
GetTargetHostFaceReference(Int32) |  Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
Top
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace